[[{"imdb_id": "tt14513804", "title": "Captain America: Brave New World", "plot": "After meeting with newly elected U.S. President Thaddeus Ross, Sam finds himself in the middle of an international incident. He must discover the reason behind a nefarious global plot before the true mastermind has the entire world seeing red.", "popularity": 111.265, "runtime": "119 min", "poster_url": "https://image.tmdb.org/t/p/w500/pzIddUEMWhWzfvLI3TwxUG2wGoi.jpg", "year": "2025", "uk_release_date": "2025-02-14", "director": "Julius Onah", "actors": "Anthony Mackie, Harrison Ford, Danny Ramirez, Shira Haas, Tim Blake Nelson, Carl Lumbly, Giancarlo Esposito, Liv Tyler, Xosha Roquemore, Jóhannes Haukur Jóhannesson", "genres": "Action, Thriller, Science Fiction", "uk_certification": "12A", "is_in_cinema": true}, {"imdb_id": "tt23770030", "title": "Memoir of a Snail", "plot": "Forcibly separated from her twin brother when they are orphaned, a melancholic misfit learns how to find confidence within herself amid the clutter of misfortunes and everyday life.", "popularity": 51.758, "runtime": "94 min", "poster_url": "https://image.tmdb.org/t/p/w500/lWh5OlerPR1c1cfn1ZLq0lpqFds.jpg", "year": "2024", "uk_release_date": "2024-10-10", "director": "Adam Elliot", "actors": "Sarah Snook, Kodi Smit-McPhee, Jacki Weaver, Magda Szubanski, Dominique Pinon, Tony Armstrong, Paul Capsis, Eric Bana, Bernie Clifford, Davey Thompson", "genres": "Animation, Drama, Comedy", "uk_certification": "15", "is_in_cinema": true}, {"imdb_id": "tt10954718", "title": "Dog Man", "plot": "When a faithful police dog and his human police officer owner are injured together on the job, a harebrained but life-saving surgery fuses the two of them together and Dog Man is born. Dog Man is sworn to protect and serve—and fetch, sit and roll over. As Dog Man embraces his new identity and strives to impress his Chief, he must stop the pretty evil plots of feline supervillain Petey the Cat.", "popularity": 51.323, "runtime": "89 min", "poster_url": "https://image.tmdb.org/t/p/w500/89wNiexZdvLQ41OQWIsQy4O6jAQ.jpg", "year": "2025", "uk_release_date": "2025-02-07", "director": "Peter Hastings", "actors": "Peter Hastings, Pete Davidson, Lil Rel Howery, Isla Fisher, Lucas Hopkins Calderon, Ricky Gervais, Poppy Liu, Stephen Root, Billy Boyd, Luenell", "genres": "Family, Animation, Comedy, Action", "uk_certification": "U", "is_in_cinema": true}, {"imdb_id": "tt12299608", "title": "Mickey 17", "plot": "Unlikely hero Mickey Barnes finds himself in the extraordinary circumstance of working for an employer who demands the ultimate commitment to the job… to die, for a living.", "popularity": 85.297, "runtime": "137 min", "poster_url": "https://image.tmdb.org/t/p/w500/edKpE9B5qN3e559OuMCLZdW1iBZ.jpg", "year": "2025", "uk_release_date": "2025-02-13", "director": "Bong Joon Ho", "actors": "Robert Pattinson, Naomi Ackie, Steven Yeun, Mark Ruffalo, Toni Collette, Anamaria Vartolomei, Daniel Henshall, Patsy Ferran, Steve Park, Tim Key", "genres": "Science Fiction, Comedy, Adventure, Fantasy", "uk_certification": "15", "is_in_cinema": true}, {"imdb_id": "tt30788842", "title": "Love Hurts", "plot": "A realtor is pulled back into the life he left behind after his former partner-in-crime resurfaces with an ominous message. With his crime-lord brother also on his trail, he must confront his past and the history he never fully buried.", "popularity": 48.704, "runtime": "83 min", "poster_url": "https://image.tmdb.org/t/p/w500/skPPVeHoTTVVSJlb0Ib5vrqiuA4.jpg", "year": "2025", "uk_release_date": "2025-02-07", "director": "Jonathan Eusebio", "actors": "Ke Huy Quan, Ariana DeBose, Mustafa Shakir, Lio Tipton, Daniel Wu, Cam Gigandet, Marshawn Lynch, André Eriksen, Rhys Darby, Sean Astin", "genres": "Action, Comedy, Romance", "uk_certification": "15", "is_in_cinema": true}, {"imdb_id": "tt26584495", "title": "Companion", "plot": "During a weekend getaway at a secluded lakeside estate, a group of friends finds themselves entangled in a web of secrets, deception, and advanced technology. As tensions rise and loyalties are tested, they uncover unsettling truths about themselves and the world around them.", "popularity": 76.824, "runtime": "97 min", "poster_url": "https://image.tmdb.org/t/p/w500/oCoTgC3UyWGfyQ9thE10ulWR7bn.jpg", "year": "2025", "uk_release_date": "2025-01-31", "director": "Drew Hancock", "actors": "Sophie Thatcher, Jack Quaid, Lukas Gage, Megan Suri, Harvey Guillén, Rupert Friend, Jaboukie Young-White, Matthew J. McCarthy, Marc Menchaca, Woody Fu", "genres": "Horror, Science Fiction, Thriller", "uk_certification": "15", "is_in_cinema": true}, {"imdb_id": "tt32558992", "title": "Heart Eyes", "plot": "When the \"Heart Eyes Killer\" strikes Seattle, a pair of co-workers pulling overtime on Valentine's Day are mistaken for a couple by the elusive couple-hunting killer. Now, they must spend the most romantic night of the year running for their lives.", "popularity": 16.739, "runtime": "97 min", "poster_url": "https://image.tmdb.org/t/p/w500/ebqttF1Vjgde6uSFBEw9mta7Hd3.jpg", "year": "2025", "uk_release_date": "2025-02-14", "director": "Josh Ruben", "actors": "Olivia Holt, Mason Gooding, Jordana Brewster, Devon Sawa, Gigi Zumbado, Ben Black, Chris Parker, Latham Gaines, Lauren O'Hara, Michaela Watkins", "genres": "Horror, Comedy, Mystery", "uk_certification": "18", "is_in_cinema": true}, {"imdb_id": "tt26452781", "title": "Marked Men: Rule + Shaw", "plot": "Shaw Landon has loved Rule Archer from the moment she laid eyes on him. Rule, a fiery-tempered rebel tattoo artist, doesn’t have time for a good girl pre-med student like Shaw — even if she’s the only one who can see the person he truly is. She lives by other people’s rules; he makes his own. But a short skirt, too many birthday cocktails, and spilled secrets lead to a night neither can forget. Now, Shaw and Rule must figure out how a girl like her and a guy like him are supposed to be together without destroying their love…or each other.", "popularity": 14.621, "runtime": "93 min", "poster_url": "https://image.tmdb.org/t/p/w500/gZQU8BtCH2IbMZq6QETiU4HXQSR.jpg", "year": "2025", "uk_release_date": "2025-02-07", "director": "Nick Cassavetes", "actors": "Chase Stokes, Sydney Taylor, Ella Balinska, Evan Mock, Alexander Ludwig, Natalie Alyn Lind, Matthew Noszka, Hannah Kepple, Daisy Jelley, Michael Bradway", "genres": "Romance, Drama", "uk_certification": "15", "is_in_cinema": true}, {"imdb_id": "tt27714946", "title": "The Monkey", "plot": "When twin brothers find a mysterious wind-up monkey, a series of outrageous deaths tear their family apart. Twenty-five years later, the monkey begins a new killing spree forcing the estranged brothers to confront the cursed toy.", "popularity": 23.485, "runtime": "98 min", "poster_url": "https://image.tmdb.org/t/p/w500/yYa8Onk9ow7ukcnfp2QWVvjWYel.jpg", "year": "2025", "uk_release_date": "2025-02-17", "director": "Osgood Perkins", "actors": "Theo James, Tatiana Maslany, Christian Convery, Colin O'Brien, Adam Scott, Elijah Wood, Rohan Campbell, Sarah Levy, Osgood Perkins, Nicco Del Rio", "genres": "Horror, Comedy", "uk_certification": "15", "is_in_cinema": true}, {"imdb_id": "tt14961016", "title": "I'm Still Here", "plot": "In 1971, military dictatorship in Brazil reaches its height. The Paiva family — Rubens, Eunice, and their five children — live in a beachside house in Rio, open to all their friends. One day, Rubens is taken for questioning and does not return.", "popularity": 18.607, "runtime": "138 min", "poster_url": "https://image.tmdb.org/t/p/w500/1tvGxo52LjsUtUlEqImD5vdb9s9.jpg", "year": "2024", "uk_release_date": "2024-10-13", "director": "Walter Salles", "actors": "Fernanda Torres, Selton Mello, Valentina Herszage, Bárbara Luz, Guilherme Silveira, Cora Ramalho, Luiza Kosovski, Pri Helena, Luiz Bertazzo, Maeve Jinkings", "genres": "Drama, History", "uk_certification": "15", "is_in_cinema": true}, {"imdb_id": "tt32221196", "title": "One of Them Days", "plot": "Best friends and roommates Dreux and Alyssa are about to have One of Them Days. When they discover Alyssa’s boyfriend has blown their rent money, the duo finds themselves going to extremes in a comical race against the clock to avoid eviction and keep their friendship intact.", "popularity": 16.464, "runtime": "97 min", "poster_url": "https://image.tmdb.org/t/p/w500/hMJRFQarUL73K6FIbhvO4A8uEvm.jpg", "year": "2025", "uk_release_date": "2025-03-07", "director": "Lawrence Lamont", "actors": "Keke Palmer, SZA, Joshua David Neal, Aziza Scott, Patrick Cage, Katt Williams, Maude Apatow, Vanessa Bell Calloway, Gabrielle Dennis, Janelle James", "genres": "Comedy", "uk_certification": "15", "is_in_cinema": true}, {"imdb_id": "tt32063050", "title": "Bridget Jones: Mad About the Boy", "plot": "Bridget Jones navigates life as a widow and single mum with the help of her family, friends, and former lover, Daniel. Back to work and on the apps, she's pursued by a younger man and maybe – just maybe – her son's science teacher.", "popularity": 15.962, "runtime": "124 min", "poster_url": "https://image.tmdb.org/t/p/w500/taEVBdVSqYo9YeN3ycw2SosklZL.jpg", "year": "2025", "uk_release_date": "2025-02-13", "director": "Michael Morris", "actors": "Renée Zellweger, Chiwetel Ejiofor, Leo Woodall, Hugh Grant, Jim Broadbent, Gemma Jones, Colin Firth, Sarah Solemani, Josette Simon, Nico Parker", "genres": "Romance, Comedy, Drama", "uk_certification": "15", "is_in_cinema": true}, {"imdb_id": "tt33175825", "title": "Attack on Titan: THE LAST ATTACK", "plot": "A colossal-sized omnibus film bringing together the last two episodes of Attack on Titan in the franchise's first-ever theatrical experience. After venturing beyond the walls and separated from his comrades, Eren finds himself inspired by this new truth and plots the \"Rumbling,\" a terrifying plan to eradicate every living thing in the world. With the fate of the world hanging in the balance, a motley crew of Eren's former comrades and enemies scramble to halt his deadly mission. The only question is, can they stop him?", "popularity": 9.015, "runtime": "145 min", "poster_url": "https://image.tmdb.org/t/p/w500/a3SWR8va3OmUVnVL05CJqXrR1GQ.jpg", "year": "2024", "uk_release_date": "2025-02-26", "director": "Yuichiro Hayashi", "actors": "Yuki Kaji, Yui Ishikawa, Marina Inoue, Hiroshi Kamiya, Yu Shimamura, Romi Park, Yoshimasa Hosoya, Kisho Taniyama, Hiro Shimono, Koji Hiwatari", "genres": "Animation, Action, Adventure, Fantasy", "uk_certification": "15", "is_in_cinema": true}, {"imdb_id": "tt28082769", "title": "September 5", "plot": "During the 1972 Munich Olympics, an American sports broadcasting crew finds itself thrust into covering the hostage crisis involving Israeli athletes.", "popularity": 8.515, "runtime": "95 min", "poster_url": "https://image.tmdb.org/t/p/w500/3kcQOLwYKGPwyjiynFsvP8vHvRn.jpg", "year": "2024", "uk_release_date": "2025-02-06", "director": "Tim Fehlbaum", "actors": "John Magaro, Leonie Benesch, Peter Sarsgaard, Ben Chaplin, Zinedine Soualem, Georgina Rich, Corey Johnson, Marcus Rutherford, Daniel Adeosun, Benjamin Walker", "genres": "Thriller, Drama, History", "uk_certification": "15", "is_in_cinema": true}, {"imdb_id": "tt32178949", "title": "The Seed of the Sacred Fig", "plot": "Investigating judge Iman grapples with paranoia amid political unrest in Tehran. When his gun vanishes, he suspects his wife and daughters, imposing draconian measures that strain family ties as societal rules crumble.", "popularity": 8.342, "runtime": "167 min", "poster_url": "https://image.tmdb.org/t/p/w500/ifOazNzv2cNJ5CQjMV7cPXG2Lmy.jpg", "year": "2024", "uk_release_date": "2024-10-14", "director": "Mohammad Rasoulof", "actors": "Misagh Zare, Soheila Golestani, Mahsa Rostami, Setareh Maleki, Niousha Akhshi, Reza Akhlaghirad, Shiva Ordooie, Amineh Mazrouie Arani, Mohammad Kamal Alavi, Parisa Mohyedini", "genres": "Drama, Thriller, Crime", "uk_certification": "15", "is_in_cinema": true}, {"imdb_id": "tt32843325", "title": "Creation of the Gods II: Demon Force", "plot": "Taishi Wen Zhong led the army of Shang Dynasty including Deng Chanyu and four generals of the Mo Family to Xiqi. With the help of Kunlun immortals such as Jiang Ziya, Ji Fa led the army and civilians of Xiqi to defend their homeland.", "popularity": 7.802, "runtime": "145 min", "poster_url": "https://image.tmdb.org/t/p/w500/kHII3r0PZ0nEGeSTSuhfAM2q1tI.jpg", "year": "2025", "uk_release_date": "2025-01-31", "director": "Wuershan", "actors": "Huang Bo, Yu Shi, Nashi, Chen Muchi, Kris Phillips, Narana Erdyneeva, Wu Hsing-Guo, Han Pengyi, Ci Sha, Wu Yafan", "genres": "Action, Fantasy, War", "uk_certification": "15", "is_in_cinema": true}, {"imdb_id": "tt27922706", "title": "Chhaava", "plot": "Shivaji's death sparks the Maratha-Mughal conflict. His son Sambhaji leads resistance against Aurangzeb's forces. Amid battles and intrigue, both sides face challenges in a struggle for power.", "popularity": 7.388, "runtime": "161 min", "poster_url": "https://image.tmdb.org/t/p/w500/9F4lPRLjfBjsu0zjWNOZQMa8a4V.jpg", "year": "2025", "uk_release_date": "2025-02-14", "director": "Laxman Utekar", "actors": "Vicky Kaushal, Rashmika Mandanna, Akshaye Khanna, Ashutosh Rana, Divya Dutta, Pradeep Ram Singh Rawat, Vineet Kumar Singh, Neil Bhoopalam, Santosh Juvekar, Rajiv Kachroo", "genres": "History, Action, Drama", "uk_certification": "15", "is_in_cinema": true}, {"imdb_id": "tt30324320", "title": "Marching Powder", "plot": "Middle-aged Jack, arrested for drugs, strives in six weeks to repair his marriage, curb a bullying in-law, and guide his stepbrother in the right direction, but all efforts fail as his life spirals further out of control.", "popularity": 7.09, "runtime": "96 min", "poster_url": "https://image.tmdb.org/t/p/w500/iDzRpQpzNE0W8hwbJMQuMLzcbVB.jpg", "year": "2025", "uk_release_date": "2025-03-05", "director": "Nick Love", "actors": "Danny Dyer, Stephanie Leonidas, Calum MacNab, Arty Dyer, Bailey Patrick, Lex Shrapnel, Janet Kumah, Geoff Bell, Philippe Brenninkmeyer, Dean Harrison", "genres": "Action, Crime, Comedy, Romance", "uk_certification": "18", "is_in_cinema": true}, {"imdb_id": "tt26720001", "title": "Stitch Head", "plot": "Follows Stitch Head, a small creature awoken by a Mad Professor in a castle to protect the professor's other creations from the townspeople of Grubbers Nubbin.", "popularity": 15.147, "runtime": "", "poster_url": "https://image.tmdb.org/t/p/w500/qwhscpTQAGrpit1ARQvvrlijp8h.jpg", "year": "2025", "uk_release_date": "2025-03-12", "director": "Steve Hudson", "actors": "Asa Butterfield, Joel Fry, Alison Steadman, Rob Brydon, Fern Brady, Tia Bannon, Jamali Maddix", "genres": "Animation, Family", "uk_certification": "U", "is_in_cinema": true}, {"imdb_id": "tt23643456", "title": "Twiggy", "plot": "Twiggy takes a comprehensive look at the life story of UK model and cultural icon Twiggy, real name Lesley Lawson, whose career kickstarted in the 1960s. It features interviews with Twiggy and her husband Leigh Lawson, as well as commentary from Erin O’Connor, Paul McCartney, Lulu, Poppy Delavigne, Brooke Shields, Pattie Boyd and Zandra Rhodes.", "popularity": 6.347, "runtime": "90 min", "poster_url": "https://image.tmdb.org/t/p/w500/7Wl4mtdA4BBxCaXfDHXkPHGvYWa.jpg", "year": "2025", "uk_release_date": "2024-10-18", "director": "Sadie Frost", "actors": "Twiggy, Leigh Lawson, Carly Wiggins, Michael Witney, Justin de Villeneuve, Joanna Lumley, Tommy Tune, Brooke Shields, Sienna Miller, Lulu", "genres": "Documentary", "uk_certification": "12A", "is_in_cinema": true}], 8]