[{"imdb_id": "tt4772188", "title": "Flow", "year": "2024", "poster_url": "https://image.tmdb.org/t/p/w500/imKSymKBK7o73sajciEmndJoVkR.jpg", "director": "Gints Zilbalodis", "plot": "A solitary cat, displaced by a great flood, finds refuge on a boat with various species and must navigate the challenges of adapting to a transformed world together.", "genres": "Animation, Fantasy, Adventure", "runtime": "85 min", "actors": "", "uk_certification": "U", "uk_release_date": "2024-10-13", "is_in_cinema": false}, {"imdb_id": "tt34956443", "title": "Ne Zha 2", "year": "2025", "poster_url": "https://image.tmdb.org/t/p/w500/cb5NyNrqiCNNoDkA8FfxHAtypdG.jpg", "director": "Yang Yu", "plot": "After the Tribulation, although the souls of Ne Zha and Ao Bing were preserved, their physical bodies would soon be completely destroyed. Tai Yi Zhen Ren plans to use the Seven Colored Lotus to reshape their physical forms. But in the process of reshaping, they encounter numerous difficulties. Where will the fate of Ne Zha and Ao Bing go?", "genres": "Animation, Fantasy, Adventure", "runtime": "144 min", "actors": "Lü Yanting, Joseph, Han Mo, Chen Hao, Lü Qi, Zhang Jiaming, Yang Wei, Wang Deshun, Yu Chen, Zhou Yongxi", "uk_certification": "12A", "uk_release_date": "2025-03-14", "is_in_cinema": false}, {"imdb_id": "tt6208148", "title": "Snow White", "year": "2025", "poster_url": "https://image.tmdb.org/t/p/w500/xWWg47tTfparvjK0WJNX4xL8lW2.jpg", "director": "Marc Webb", "plot": "A beautiful girl, Snow White, takes refuge in the forest in the house of seven dwarfs to hide from her stepmother, the wicked Queen. The Queen is jealous because she wants to be known as 'the fairest in the land', and Snow White's beauty surpasses her own.", "genres": "Family, Fantasy", "runtime": "109 min", "actors": "Rachel Zegler, Gal Gadot, Emilia Faucher, Andrew Burnap, Andrew Barth Feldman, Tituss Burgess, Martin Klebba, Jason Kravits, George Salazar, Jeremy Swift", "uk_certification": "PG", "uk_release_date": "2025-03-21", "is_in_cinema": false}, {"imdb_id": "tt9150192", "title": "A Working Man", "year": "2025", "poster_url": "https://image.tmdb.org/t/p/w500/6FRFIogh3zFnVWn7Z6zcYnIbRcX.jpg", "director": "David Ayer", "plot": "Levon Cade left behind a decorated military career in the black ops to live a simple life working construction. But when his boss's daughter, who is like family to him, is taken by human traffickers, his search to bring her home uncovers a world of corruption far greater than he ever could have imagined.", "genres": "Action, Thriller", "runtime": "116 min", "actors": "Jason Statham, David Harbour, Michael Peña, Jason Flemyng, Arianna Rivas, Noemi Gonzalez, Emmett Scanlan, Eve Mauro, Maximilian Osinski, Kristina Poli", "uk_certification": "15", "uk_release_date": "2025-03-28", "is_in_cinema": false}, {"imdb_id": "tt4419684", "title": "In the Lost Lands", "year": "2025", "poster_url": "https://image.tmdb.org/t/p/w500/dDlfjR7gllmr8HTeN6rfrYhTdwX.jpg", "director": "Paul W. S. Anderson", "plot": "A queen sends the powerful and feared sorceress Gray Alys to the ghostly wilderness of the Lost Lands in search of a magical power, where the sorceress and her guide, the drifter Boyce must outwit and outfight man and demon.", "genres": "Fantasy, Adventure, Action", "runtime": "102 min", "actors": "Milla Jovovich, Dave Bautista, Arly Jover, Amara Okereke, Fraser James, Deirdre Mullins, Sebastian Stankiewicz, Tue Lunding, Jacek Dzisiewicz, Ian Hanmore", "uk_certification": "15", "uk_release_date": "2025-03-14", "is_in_cinema": false}, {"imdb_id": "tt29603959", "title": "Novocaine", "year": "2025", "poster_url": "https://image.tmdb.org/t/p/w500/xEXDIJFenYgRwpsJs1mx6hr1DKy.jpg", "director": "Dan Berk, Robert Olsen", "plot": "When the girl of his dreams is kidnapped, everyman Nate turns his inability to feel pain into an unexpected strength in his fight to get her back.", "genres": "Action, Thriller, Comedy", "runtime": "110 min", "actors": "Jack Quaid, Amber Midthunder, Ray Nicholson, Jacob Batalon, Betty Gabriel, Matt Walsh, Evan Hengst, Conrad Kemp, Jessica Stanley, Dominique Maher", "uk_certification": "15", "uk_release_date": "2025-03-28", "is_in_cinema": false}, {"imdb_id": "tt30988739", "title": "Black Bag", "year": "2025", "poster_url": "https://image.tmdb.org/t/p/w500/lqLREJDLI6p1zbrds4yzYR5wtEG.jpg", "director": "Steven Soderbergh", "plot": "When his beloved wife is suspected of betraying the nation, an intelligence agent faces the ultimate test – loyalty to his marriage or his country.", "genres": "Thriller, Drama", "runtime": "94 min", "actors": "Michael Fassbender, Cate Blanchett, Regé-Jean Page, Marisa Abela, Naomie Harris, Tom Burke, Pierce Brosnan, Orli Shuka, Daniel Fearn, Alex Magliaro", "uk_certification": "15", "uk_release_date": "2025-03-14", "is_in_cinema": false}, {"imdb_id": "tt6874690", "title": "The Rule of Jenny Pen", "year": "2025", "poster_url": "https://image.tmdb.org/t/p/w500/4SObUx3qHHjqnQQqZ9ikMtzM6ii.jpg", "director": "James Ashcroft", "plot": "Confined to a secluded rest home and trapped within his stroke-ridden body, a former Judge must stop an elderly psychopath who employs a child's puppet to abuse the home's residents with deadly consequences.", "genres": "Thriller, Horror, Drama", "runtime": "104 min", "actors": "Geoffrey Rush, John Lithgow, George Henare, Nathaniel Lees, Thomas Sainsbury, Maaka Pohatu, Irene Wood, Ian Mune, Bruce Phillips, Holly Shanahan", "uk_certification": "15", "uk_release_date": "2025-03-14", "is_in_cinema": false}, {"imdb_id": "tt14403504", "title": "Last Breath", "year": "2025", "poster_url": "https://image.tmdb.org/t/p/w500/w04Xg5Bnqj7ECdCxTsHgqK6AtJW.jpg", "director": "Alex Parkinson", "plot": "A true story about seasoned deep-sea divers who battle the raging elements to rescue their crewmate trapped hundreds of feet below the ocean’s surface.", "genres": "Thriller, Drama", "runtime": "93 min", "actors": "Woody Harrelson, Simu Liu, Finn Cole, Cliff Curtis, Mark Bonnar, MyAnna Buring, Josef Altin, Bobby Rainsbury, Connor Reed, Nick Biadon", "uk_certification": "12A", "uk_release_date": "2025-03-14", "is_in_cinema": false}, {"imdb_id": "tt27218960", "title": "Y2K", "year": "2024", "poster_url": "https://image.tmdb.org/t/p/w500/qndubIQalyxBJI5EBNZKGXEX74q.jpg", "director": "Kyle Mooney", "plot": "Two high school nobodies make the decision to crash the last major celebration before the new millennium on New Year's Eve 1999. The night becomes even crazier than they could have ever dreamed when the clock strikes midnight.", "genres": "Comedy, Horror, Science Fiction", "runtime": "92 min", "actors": "Jaeden Martell, Rachel Zegler, Julian Dennison, Daniel Zolghadri, Lachlan Watson, Fred Durst, Kyle Mooney, Eduardo Franco, Mason Gooding, The Kid LAROI", "uk_certification": "18", "uk_release_date": "2025-03-21", "is_in_cinema": false}, {"imdb_id": "tt21815562", "title": "The Alto Knights", "year": "2025", "poster_url": "https://image.tmdb.org/t/p/w500/95KmR0xNuZZ6DNESDwLKWGIBvMg.jpg", "director": "Barry Levinson", "plot": "Two of New York's most notorious organized crime bosses, Frank Costello and Vito Genovese, vie for control of the city's streets. Once the best of friends, petty jealousies and a series of betrayals place them on a deadly collision course that will reshape the Mafia (and America) forever.", "genres": "Drama, Crime", "runtime": "123 min", "actors": "Robert De Niro, Debra Messing, Cosmo Jarvis, Kathrine Narducci, Michael Rispoli, Michael Adler, Ed Amatrudo, Joe Bacino, Anthony J. Gallo, Wallace Langham", "uk_certification": "15", "uk_release_date": "2025-03-21", "is_in_cinema": false}, {"imdb_id": "tt29929565", "title": "Opus", "year": "2025", "poster_url": "https://image.tmdb.org/t/p/w500/m0du9dsiOVeb0SgfqR8ZAEPRxww.jpg", "director": "Mark Anthony Green", "plot": "A young writer is invited to the remote compound of a legendary pop star who mysteriously disappeared thirty years ago. Surrounded by the star's cult of sycophants and intoxicated journalists, she finds herself in the middle of his twisted plan.", "genres": "Thriller, Mystery, Horror", "runtime": "104 min", "actors": "Ayo Edebiri, John Malkovich, Juliette Lewis, Murray Bartlett, Stephanie Suganami, Young Mazino, Amber Midthunder, Tony Hale, Tatanka Means, Tamera Tomakili", "uk_certification": "15", "uk_release_date": "2025-03-14", "is_in_cinema": false}, {"imdb_id": "tt19869662", "title": "Irena's Vow", "year": "2024", "poster_url": "https://image.tmdb.org/t/p/w500/lN6iCgTgpNlylelUctrA29wJx4W.jpg", "director": "Louise Archambault", "plot": "19 year old Irena Gut is promoted to housekeeper in the home of a highly respected Nazi officer in Poland when she finds out that the Jewish ghetto is about to be liquidated. Determined to help twelve Jewish workers, she decides to shelter them in the safest place she can think of – the basement of the German Major's house. Over the next eight months, Irena uses her wit, humour and immense courage to hide her friends as long as possible.", "genres": "War, Drama", "runtime": "121 min", "actors": "Sophie Nélisse, Dougray Scott, Andrzej Seweryn, Maciej Nawrocki, Sharon Azrieli, Eliza Rycembel, Aleksandar Milićević, Agata Turkot, Filip Kosior, Krzysztof Szczepaniak", "uk_certification": null, "uk_release_date": "2025-03-28", "is_in_cinema": false}, {"imdb_id": "tt31314296", "title": "The Woman in the Yard", "year": "2025", "poster_url": "https://image.tmdb.org/t/p/w500/n0WS2TsNcS6dtaZKzxipyO7LuCJ.jpg", "director": "Jaume Collet-Serra", "plot": "Ramona becomes crippled by grief after her husband dies in a car accident, leaving her to care for her two children alone in her rural farmhouse. Her sadness soon turns to fear when a spectral woman in black appears on her front lawn, warning her 'today's the day'. As the mysterious figure creeps closer and closer to the house, Ramona realizes she must protect her children from the evil who simply won't leave them alone.", "genres": "Horror, Mystery, Drama", "runtime": "88 min", "actors": "Danielle Deadwyler, Okwui Okpokwasili, Russell Hornsby, Peyton Jackson, Estella Kahiha", "uk_certification": "15", "uk_release_date": "2025-03-28", "is_in_cinema": false}, {"imdb_id": "tt15551346", "title": "The End", "year": "2024", "poster_url": "https://image.tmdb.org/t/p/w500/kYMLpw3DQjQjp2jzNrg3KvNFIr6.jpg", "director": "Joshua Oppenheimer", "plot": "Twenty-five years after environmental collapse left the Earth uninhabitable, Mother, Father and Son are confined to their palatial bunker, where they struggle to maintain hope and a sense of normalcy by clinging to the rituals of daily life—until the arrival of a stranger, Girl, upends their happy routine. As tensions rise, their seemingly idyllic existence starts to crumble.", "genres": "Drama, Fantasy, Science Fiction, Music", "runtime": "149 min", "actors": "Tilda Swinton, George MacKay, Moses Ingram, Michael Shannon, Bronagh Gallagher, Tim McInnerny, Lennie James, Danielle Ryan", "uk_certification": "12A", "uk_release_date": "2024-10-11", "is_in_cinema": false}, {"imdb_id": "tt26720001", "title": "Stitch Head", "year": "2025", "poster_url": "https://image.tmdb.org/t/p/w500/qwhscpTQAGrpit1ARQvvrlijp8h.jpg", "director": "Steve Hudson", "plot": "Follows Stitch Head, a small creature awoken by a Mad Professor in a castle to protect the professor's other creations from the townspeople of Grubbers Nubbin.", "genres": "Animation, Family", "runtime": "", "actors": "Asa Butterfield, Joel Fry, Alison Steadman, Rob Brydon, Fern Brady, Tia Bannon, Jamali Maddix", "uk_certification": "U", "uk_release_date": "2025-03-12", "is_in_cinema": false}, {"imdb_id": "tt19864832", "title": "La Cocina", "year": "2024", "poster_url": "https://image.tmdb.org/t/p/w500/2zhdUl8KWK8QGATbWTRGexYthZT.jpg", "director": "Alonso Ruizpalacios", "plot": "It is the lunchtime rush at The Grill, a New York tourist trap that serves thousands of customers on a regular Friday like today. Money has gone missing from the till and all the workers are being questioned.", "genres": "Comedy, Drama", "runtime": "139 min", "actors": "Raúl Briones, Rooney Mara, Anna Díaz, Motell Gyn Foster, Laura Gómez, Oded Fehr, James Waterston, Lee Sellars, Eduardo Olmos, Spenser Granese", "uk_certification": "15", "uk_release_date": "2024-10-10", "is_in_cinema": false}, {"imdb_id": "tt32060445", "title": "Sister Midnight", "year": "2025", "poster_url": "https://image.tmdb.org/t/p/w500/lXMJ6un3SZvRq8cOHap7LviY5hG.jpg", "director": "Karan Kandhari", "plot": "In Mumbai, an arranged marriage spirals into darkness as the spineless husband watches his wife morph into a ruthless, feral force within their marital confines.", "genres": "Comedy, Drama, Horror", "runtime": "107 min", "actors": "Radhika Apte, Ashok Pathak, Chhaya Kadam, Smita Tambe, Navya Sawant, Dev Raaz, Chaitanya Solankar, Suhaas Ahuja, Masashi Fujimoto, Daemian Greaves", "uk_certification": "15", "uk_release_date": "2024-10-16", "is_in_cinema": false}, {"imdb_id": "tt13232552", "title": "The Man in the White Van", "year": "2024", "poster_url": "https://image.tmdb.org/t/p/w500/A98LHlo4wvgV3d79IovLhL0KSL5.jpg", "director": "Warren Skeels", "plot": "In early 1970s Florida, an ominous white van stalks young women. A teenage girl is the latest victim, but this one won't stay a victim.", "genres": "Horror, Thriller", "runtime": "105 min", "actors": "Sean Astin, Ali Larter, Madison Wolfe, Brec Bassinger, Skai Jackson, Gavin Warren, Julianne Arrieta, Brighton Sharbino, Ryan Whitney, Addison Riecke", "uk_certification": null, "uk_release_date": "2025-03-28", "is_in_cinema": false}, {"imdb_id": "tt30444418", "title": "Santosh", "year": "2024", "poster_url": "https://image.tmdb.org/t/p/w500/c4LdJKjE7Du2ofKsyDrmwZs9u5m.jpg", "director": "Sandhya Suri", "plot": "A government scheme sees newly widowed Santosh inherit her husband’s job as a police constable in the rural badlands of Northern India. When a low-caste girl is found raped and murdered, she is pulled into the investigation under the wing of charismatic feminist inspector Sharma.", "genres": "Crime, Drama, Thriller", "runtime": "128 min", "actors": "Shahana Goswami, Sunita Rajwar, Naval Shukla, Sanjay Bishnoi, Shashi Beniwal, Prashant Kumar, Pratibha Awasthi, Manjul Azad, Anamika Gupta, Kuldeep Saini", "uk_certification": "15", "uk_release_date": "2024-10-13", "is_in_cinema": false}]