[[{"imdb_id": "tt4772188", "title": "Flow", "plot": "A solitary cat, displaced by a great flood, finds refuge on a boat with various species and must navigate the challenges of adapting to a transformed world together.", "popularity": 104.294, "runtime": "85 min", "poster_url": "https://image.tmdb.org/t/p/w500/imKSymKBK7o73sajciEmndJoVkR.jpg", "year": "2024", "uk_release_date": "2024-10-13", "director": "Gints Zilbalodis", "actors": "", "genres": "Animation, Fantasy, Adventure", "uk_certification": "U", "is_in_cinema": true}, {"imdb_id": "tt34956443", "title": "Ne Zha 2", "plot": "After the Tribulation, although the souls of Ne Zha and Ao Bing were preserved, their physical bodies would soon be completely destroyed. Tai Yi Zhen Ren plans to use the Seven Colored Lotus to reshape their physical forms. But in the process of reshaping, they encounter numerous difficulties. Where will the fate of Ne Zha and Ao Bing go?", "popularity": 26.775, "runtime": "144 min", "poster_url": "https://image.tmdb.org/t/p/w500/cb5NyNrqiCNNoDkA8FfxHAtypdG.jpg", "year": "2025", "uk_release_date": "2025-03-14", "director": "Yang Yu", "actors": "Lü Yanting, Joseph, Han Mo, Chen Hao, Lü Qi, Zhang Jiaming, Yang Wei, Wang Deshun, Yu Chen, Zhou Yongxi", "genres": "Animation, Fantasy, Adventure", "uk_certification": "12A", "is_in_cinema": true}, {"imdb_id": "tt29603959", "title": "Novocaine", "plot": "When the girl of his dreams is kidnapped, everyman Nate turns his inability to feel pain into an unexpected strength in his fight to get her back.", "popularity": 23.471, "runtime": "110 min", "poster_url": "https://image.tmdb.org/t/p/w500/xEXDIJFenYgRwpsJs1mx6hr1DKy.jpg", "year": "2025", "uk_release_date": "2025-03-28", "director": "Dan Berk, Robert Olsen", "actors": "Jack Quaid, Amber Midthunder, Ray Nicholson, Jacob Batalon, Betty Gabriel, Matt Walsh, Evan Hengst, Conrad Kemp, Jessica Stanley, Dominique Maher", "genres": "Action, Thriller, Comedy", "uk_certification": "15", "is_in_cinema": true}, {"imdb_id": "tt30988739", "title": "Black Bag", "plot": "When his beloved wife is suspected of betraying the nation, an intelligence agent faces the ultimate test – loyalty to his marriage or his country.", "popularity": 21.531, "runtime": "94 min", "poster_url": "https://image.tmdb.org/t/p/w500/9z32e4ziLQs10NYewgO2CqUWjM7.jpg", "year": "2025", "uk_release_date": "2025-03-14", "director": "Steven Soderbergh", "actors": "Michael Fassbender, Cate Blanchett, Marisa Abela, Tom Burke, Naomie Harris, Regé-Jean Page, Pierce Brosnan, Gustaf Skarsgård, Kae Alexander, Martin Bassindale", "genres": "Thriller, Drama", "uk_certification": "15", "is_in_cinema": true}, {"imdb_id": "tt6208148", "title": "Snow White", "plot": "A beautiful girl, Snow White, takes refuge in the forest in the house of seven dwarfs to hide from her stepmother, the wicked Queen. The Queen is jealous because she wants to be known as 'the fairest in the land', and Snow White's beauty surpasses her own.", "popularity": 15.538, "runtime": "109 min", "poster_url": "https://image.tmdb.org/t/p/w500/xWWg47tTfparvjK0WJNX4xL8lW2.jpg", "year": "2025", "uk_release_date": "2025-03-21", "director": "Marc Webb", "actors": "Rachel Zegler, Emilia Faucher, Gal Gadot, Andrew Burnap, Andrew Barth Feldman, Tituss Burgess, Martin Klebba, Jason Kravits, George Salazar, Jeremy Swift", "genres": "Family, Fantasy", "uk_certification": "PG", "is_in_cinema": true}, {"imdb_id": "tt26720001", "title": "Stitch Head", "plot": "Follows Stitch Head, a small creature awoken by a Mad Professor in a castle to protect the professor's other creations from the townspeople of Grubbers Nubbin.", "popularity": 15.147, "runtime": "", "poster_url": "https://image.tmdb.org/t/p/w500/qwhscpTQAGrpit1ARQvvrlijp8h.jpg", "year": "2025", "uk_release_date": "2025-03-12", "director": "Steve Hudson", "actors": "Asa Butterfield, Joel Fry, Alison Steadman, Rob Brydon, Fern Brady, Tia Bannon, Jamali Maddix", "genres": "Animation, Family", "uk_certification": "U", "is_in_cinema": true}, {"imdb_id": "tt29929565", "title": "Opus", "plot": "A young writer is invited to the remote compound of a legendary pop star who mysteriously disappeared thirty years ago. Surrounded by the star's cult of sycophants and intoxicated journalists, she finds herself in the middle of his twisted plan.", "popularity": 10.989, "runtime": "104 min", "poster_url": "https://image.tmdb.org/t/p/w500/8jQoQtKlJZUfzqdYNTLMwSdjnWs.jpg", "year": "2025", "uk_release_date": "2025-03-14", "director": "Mark Anthony Green", "actors": "Ayo Edebiri, John Malkovich, Juliette Lewis, Murray Bartlett, Stephanie Suganami, Young Mazino, Amber Midthunder, Tony Hale, Tatanka Means, Tamera Tomakili", "genres": "Thriller, Mystery, Horror", "uk_certification": "15", "is_in_cinema": true}, {"imdb_id": "tt9150192", "title": "A Working Man", "plot": "Levon Cade left behind a decorated military career in the black ops to live a simple life working construction. But when his boss's daughter, who is like family to him, is taken by human traffickers, his search to bring her home uncovers a world of corruption far greater than he ever could have imagined.", "popularity": 10.971, "runtime": "116 min", "poster_url": "https://image.tmdb.org/t/p/w500/6FRFIogh3zFnVWn7Z6zcYnIbRcX.jpg", "year": "2025", "uk_release_date": "2025-03-28", "director": "David Ayer", "actors": "Jason Statham, David Harbour, Michael Peña, Jason Flemyng, Arianna Rivas, Noemi Gonzalez, Emmett Scanlan, Eve Mauro, Maximilian Osinski, Kristina Poli", "genres": "Action, Thriller", "uk_certification": "15", "is_in_cinema": true}, {"imdb_id": "tt4419684", "title": "In the Lost Lands", "plot": "A queen sends the powerful and feared sorceress Gray Alys to the ghostly wilderness of the Lost Lands in search of a magical power, where the sorceress and her guide, the drifter Boyce must outwit and outfight man and demon.", "popularity": 10.21, "runtime": "102 min", "poster_url": "https://image.tmdb.org/t/p/w500/dDlfjR7gllmr8HTeN6rfrYhTdwX.jpg", "year": "2025", "uk_release_date": "2025-03-14", "director": "Paul W. S. Anderson", "actors": "Milla Jovovich, Dave Bautista, Arly Jover, Amara Okereke, Fraser James, Deirdre Mullins, Sebastian Stankiewicz, Tue Lunding, Jacek Dzisiewicz, Ian Hanmore", "genres": "Fantasy, Adventure, Action", "uk_certification": "15", "is_in_cinema": true}, {"imdb_id": "tt21815562", "title": "The Alto Knights", "plot": "Two of New York's most notorious organized crime bosses, Frank Costello and Vito Genovese, vie for control of the city's streets. Once the best of friends, petty jealousies and a series of betrayals place them on a deadly collision course that will reshape the Mafia (and America) forever.", "popularity": 7.83, "runtime": "123 min", "poster_url": "https://image.tmdb.org/t/p/w500/95KmR0xNuZZ6DNESDwLKWGIBvMg.jpg", "year": "2025", "uk_release_date": "2025-03-21", "director": "Barry Levinson", "actors": "Robert De Niro, Debra Messing, Cosmo Jarvis, Kathrine Narducci, Michael Rispoli, Michael Adler, Ed Amatrudo, Joe Bacino, Anthony J. Gallo, Wallace Langham", "genres": "Drama, Crime", "uk_certification": "15", "is_in_cinema": true}, {"imdb_id": "tt32060445", "title": "Sister Midnight", "plot": "In Mumbai, an arranged marriage spirals into darkness as the spineless husband watches his wife morph into a ruthless, feral force within their marital confines.", "popularity": 7.713, "runtime": "107 min", "poster_url": "https://image.tmdb.org/t/p/w500/lXMJ6un3SZvRq8cOHap7LviY5hG.jpg", "year": "2025", "uk_release_date": "2024-10-16", "director": "Karan Kandhari", "actors": "Radhika Apte, Ashok Pathak, Chhaya Kadam, Smita Tambe, Navya Sawant, Dev Raaz, Chaitanya Solankar, Suhaas Ahuja, Masashi Fujimoto, Daemian Greaves", "genres": "Comedy, Drama, Horror", "uk_certification": "15", "is_in_cinema": true}, {"imdb_id": "tt20123486", "title": "The Regulars", "plot": "Set in London's iconic Prince Charles Cinema, The Regulars follows a day in the life of its hapless employees. During their shift they watch movies, argue with customers, and, above all, deal with each other.", "popularity": 7.683, "runtime": "106 min", "poster_url": "https://image.tmdb.org/t/p/w500/uXcTWEMxpKGRzhBTJkFdFAYJnab.jpg", "year": "2025", "uk_release_date": "2025-03-14", "director": "Fil Freitas", "actors": "Fil Freitas, Sergio Barba, Lauren Shotton, Ricardo Freitas, Kevin Johnson, Shaun Stone, John Chisham, Lisa-Marie Flowers Larsen, Dusty Keeney, Edward Mannion", "genres": "Comedy", "uk_certification": null, "is_in_cinema": true}, {"imdb_id": "tt6874690", "title": "The Rule of Jenny Pen", "plot": "Confined to a secluded rest home and trapped within his stroke-ridden body, a former Judge must stop an elderly psychopath who employs a child's puppet to abuse the home's residents with deadly consequences.", "popularity": 6.732, "runtime": "104 min", "poster_url": "https://image.tmdb.org/t/p/w500/4SObUx3qHHjqnQQqZ9ikMtzM6ii.jpg", "year": "2025", "uk_release_date": "2025-03-14", "director": "James Ashcroft", "actors": "Geoffrey Rush, John Lithgow, George Henare, Nathaniel Lees, Thomas Sainsbury, Maaka Pohatu, Irene Wood, Ian Mune, Bruce Phillips, Holly Shanahan", "genres": "Thriller, Horror, Drama", "uk_certification": "15", "is_in_cinema": true}, {"imdb_id": "tt14403504", "title": "Last Breath", "plot": "A true story about seasoned deep-sea divers who battle the raging elements to rescue their crewmate trapped hundreds of feet below the ocean’s surface.", "popularity": 5.381, "runtime": "93 min", "poster_url": "https://image.tmdb.org/t/p/w500/w04Xg5Bnqj7ECdCxTsHgqK6AtJW.jpg", "year": "2025", "uk_release_date": "2025-03-14", "director": "Alex Parkinson", "actors": "Woody Harrelson, Simu Liu, Finn Cole, Cliff Curtis, Mark Bonnar, MyAnna Buring, Josef Altin, Bobby Rainsbury, Connor Reed, Nick Biadon", "genres": "Thriller, Drama", "uk_certification": "12A", "is_in_cinema": true}, {"imdb_id": "tt27218960", "title": "Y2K", "plot": "Two high school nobodies make the decision to crash the last major celebration before the new millennium on New Year's Eve 1999. The night becomes even crazier than they could have ever dreamed when the clock strikes midnight.", "popularity": 4.25, "runtime": "92 min", "poster_url": "https://image.tmdb.org/t/p/w500/qndubIQalyxBJI5EBNZKGXEX74q.jpg", "year": "2024", "uk_release_date": "2025-03-21", "director": "Kyle Mooney", "actors": "Jaeden Martell, Rachel Zegler, Julian Dennison, Daniel Zolghadri, Lachlan Watson, Fred Durst, Kyle Mooney, Eduardo Franco, Mason Gooding, The Kid LAROI", "genres": "Comedy, Horror, Science Fiction", "uk_certification": "18", "is_in_cinema": true}, {"imdb_id": "tt35397631", "title": "Dawn of Impressionism: Paris 1874", "plot": "The Impressionists are the most popular group in art history – millions flock every year to marvel at their masterpieces. But, to begin with, they were scorned, penniless outsiders. 1874 was the year that changed everything; the first Impressionists, “hungry for independence”, broke the mould by holding their own exhibition outside official channels. Impressionism was born and the art world was changed forever.  What led to that first groundbreaking show 150 years ago? Who were the maverick personalities that wielded their brushes in such a radical and provocative way? The spectacular Musée d’Orsay exhibition brings fresh eyes to this extraordinary tale of passion and rebellion. The story is told not by historians and curators but in the words of those who witnessed the dawn of Impressionism: the artists, press and people of Paris, 1874.", "popularity": 3.38, "runtime": "92 min", "poster_url": "https://image.tmdb.org/t/p/w500/lSU85MrxOtlrvtiRlI9GTPBGiwK.jpg", "year": "2025", "uk_release_date": "2025-03-18", "director": "Ali Ray", "actors": "", "genres": "Documentary", "uk_certification": "PG", "is_in_cinema": true}, {"imdb_id": "tt35684679", "title": "Six Each", "plot": "A student in Canada faces charges in her husband's death after allegedly deceiving him for visa purposes, highlighting immigrant families' desperate pursuit of opportunities.", "popularity": 3.842, "runtime": "114 min", "poster_url": "https://image.tmdb.org/t/p/w500/nYHk4K1mDWPYMK7C52DSkfoG98X.jpg", "year": "2025", "uk_release_date": "2025-03-14", "director": "Garry Khatrao", "actors": "Mandy Takhar, Hardeep Grewal, Sanju Solanki, Malkeet Rauni, Sukhdev Barnala, Amaninder Pal singh, Gurpreet Toti, Baljinder Kaur, Satwinder Kaur, Harinder Bhullar", "genres": "Crime, Drama", "uk_certification": "12A", "is_in_cinema": true}, {"imdb_id": null, "title": "Loud and Cleo !", "plot": "Cleo seeks refuge from a hostile school environment in a glitter ball fantasy make believe world... and the boys toilets. Little does she know that someone else is hiding there too.", "popularity": 2.607, "runtime": "17 min", "poster_url": null, "year": "2025", "uk_release_date": "2025-03-20", "director": "Tallulah Farquhar", "actors": "Lena Girard Voss, Léontine Clerbois, Martin Meersman, Sankara BOON, Ismaël BRASSEUR, Delphine Roy, Yannick Farquhar, Keith Farquhar", "genres": "", "uk_certification": null, "is_in_cinema": true}, {"imdb_id": "tt33305581", "title": "Shiver Me Timbers", "plot": "In 1986 Northern California, Olive Oyl, her brother Castor and friends, go on a camping trip to see the meteor shower with Halley's comet. But the night turns into horror as a meteor transforms Popeye, into a unstoppable killing machine.", "popularity": 2.605, "runtime": "74 min", "poster_url": "https://image.tmdb.org/t/p/w500/7xyVMzLkoYyIicXsuhvAvM6W4j6.jpg", "year": "2025", "uk_release_date": "2025-03-20", "director": "Paul Stephen Mann", "actors": "Amy Mackie, Brendan Nelson, Tony Greer, David Hallows, Niamh Parrington, Paul Dewdney, Paul Stephen Mann, Stephen Corrall, Keith Hewitt", "genres": "Horror, Comedy", "uk_certification": null, "is_in_cinema": true}, {"imdb_id": null, "title": "RB&O Live 2024/25: Romeo and Juliet", "plot": "The Capulets and Montagues are sworn enemies. Yet it is love at first sight for Romeo Montague and Juliet Capulet when they meet each other at the Capulet ball, into which Romeo has snuck. The two fall in love and they profess their devotion to each other at Juliet’s balcony. They secretly get married.", "popularity": 2.601, "runtime": "210 min", "poster_url": "https://image.tmdb.org/t/p/w500/zVsdWQHBkiM7Nu3efuxFAkfNYPL.jpg", "year": "2025", "uk_release_date": "2025-03-20", "director": "", "actors": "", "genres": "", "uk_certification": null, "is_in_cinema": true}], 3]